{
  "wednesday": [
    {
      "title": "Weekly Update - November 2025",
      "releaseDate": "2025-11-05",
      "file": "wednesdays/week1.jpg",
      "image": "wednesdays/week1.jpg",
      "description": "'A mentor is someone who allows you to see the hope inside yourself.' - Oprah Winfrey. This quote beautifully captures how mentorship nurtures emotional wellness by helping individuals recognize their inner strength and potential."
    },
    {
      "title": "Weekly Update - November 2025",
      "releaseDate": "2025-11-12",
      "file": "wednesdays/week2.jpg",
      "image": "wednesdays/week2.jpg",
      "description": "'Mentoring is a brain to pick, an ear to listen, and a push in the right direction.' - John C. Crosby. This quote emphasizes the holistic support mentors offer - intellectual, emotional, and motivational - contributing to both personal growth and empowerment."
    },
    {
      "title": "Weekly Update - November 2025",
      "releaseDate": "2025-11-19",
      "file": "wednesdays/week3.jpg",
      "image": "wednesdays/week3.jpg",
      "description": "'Show me a successful individual and I will show you someone who had real positive influences in their life. I don't care what you do for a living - if you do it well I'm sure there was someone cheering you on or showing the way. A mentor.' - Denzel Washington."
    },
    {
      "title": "Weekly Update - November 2025",
      "releaseDate": "2025-11-26",
      "file": "wednesdays/week4.jpg",
      "image": "wednesdays/week4.jpg",
      "description": "'Mentorship is not just about guiding others, - its about lighting the path so they can walk it with confidence.' - Unknown. A reminder that empowerment comes not from control, but from enabling others to independently."
    }
  ],
  "monday":[
    {
        "title": "Weekly Update - November 2025",
        "releaseDate": "2025-11-03",
        "file": "mondays/week1.jpg",
        "image": "mondays/week1.jpg",
        "description": "Jita it's important to keep in mind that mentorship is a gift - it's about giving time, wisdom, and encouragement to shape someone's journey."
    },
    {
        "title": "Weekly Update - November 2025",
        "releaseDate": "2025-11-10",
        "file": "mondays/week2.jpg",
        "image": "mondays/week2.jpg",
        "description": "Effective mentors engage mentees effectively, fostering deeper learning and growth. Hence it is critical to ensure that those who we mentor are active participants in their mentorship journey."
    },
    {
        "title": "Weekly Update - November 2025",
        "releaseDate": "2025-11-17",
        "file": "mondays/week3.jpg",
        "image": "mondays/week3.jpg",
        "description": "Jita, lets advocate for mentorship being about helping others recognize and harness their own strengths. "
    },
    {
        "title": "Weekly Update - November 2025",
        "releaseDate": "2025-11-24",
        "file": "mondays/week4.jpg",
        "image": "mondays/week4.jpg",
        "description": "in essence jita, mentorship is a powerful way to leave a lasting legacy through the lives you influence."

    }
  ]
}
